{
  "basics": {
    "name": "John A. Carter",
    "label": "Systems Administrator",
    "email": "johncarter@warlordofmars.net",
    "phone": "(770) 598-7096",
    "summary": "An experienced and accomplished Systems Administrator, with a background in software development, that has demonstrated a strong passion for automation and innovation of all facets related to the software development life-cycle and all underlying infrastructure required.  Looking for a position that would leverage principles from software development, traditional systems administration, and other principles under the DevOps umbrella, in order to contribute to, and improve, an overall customer value chain of an organization that shares the same passion.",
    "location": {
      "address": "42 Chauncy Street Apt 5C",
      "postalCode": "MA 02111",
      "city": "Boston",
      "countryCode": "US",
      "region": "Massachucetts"
    }
  },
  "work": [
    {
      "company": "Hachette Book Group",
      "position": "Principal Systems Administrator",
      "website": "http://www.hachettebookgroup.com",
      "startDate": "2010-12-01",
      "summary": "Provided infrastructure and application support for a book publishing company.",
      "highlights": [
        "Architected and iasdfmplemented a complete private cloud infrastructure utilizing HP Servers, NetApp Storage, and VMware",
        "Migrated all legacy applications and physical servers to private cloud infrastructure",
        "Provided lead infrastructure support in effort involving transitioning off of mainframe-based application to more modern application framework hosted in private cloud infrastructure",
        "Developed enterprise-level job scheduler responsible for stuff",
        "Developed infrastructure dashboards for executives providing real time stats and uptime",
        "Developed automated workflow for release of new builds to dev/test/stage/prod",
        "Implemented configuration management throughout the environment using Puppet",
        "Implemented a custom Puppet ENC that defined all nodes and what was to be installed on each node",
        "Developed a custom application that served as global repository of aggregated information about all infrastructure elements (servers, virtual machines, storage, databases, networks, etc.), dynamically populated by what is actually in the environment",
        "Implemented Kanban style workflow for Infrastructure Team which include specific checkpoints for elaboration and documentation",
        "Developed repeatable pattern for automation of all internally developed applications",
        "Highly optimized NetApp filers for optimal performance of high-load Oracle databases",
        "Provided in-depth monitoring of all aspects of the infrastructure via OMD (Check MK / Nagios)",
        "Developed custom synthetic-transaction-style monitoring checks that accurately simulated what a real user would be doing"
      ]
    },
    {
      "company": "Digi-Net Technologies, Inc.",
      "position": "Director of Technology",
      "location": "Atlanta, GA",
      "startDate": "2006-01-01",
      "endDate": "2010-12-01",
      "summary": "Managed all software development and infrastructure supporting a varying range of Java-based SaaS applications",
      "highlights": [
        "Managed team of offshore developers in Novsibirsk, Russia",
        "Managed team of freelance development consultants",
        "Led development effort of a visitor profiling and engagement engine, used by Amtrak.com",
        "Led development effort of real estate web marketing application",
        "Led development effort of social network email client application",
        "Led development and maintenance of legacy applications",
        "Architected and implemented a complete private cloud infrastructure utilizing Dell Servers and Storage, and XenServer",
        "Migrated all legacy applications and physical servers to private cloud infrastructure",
        "Developed custom automated build / release processes",
        "Developed a custom reporting and analytics system using AWS"

      ]
    },
    {
      "company": "Digi-Net Technologies, Inc.",
      "position": "Senior Systems Administrator",
      "startDate": "2002-04-01",
      "endDate": "2006-01-01",
      "summary": "Managed all infrastructure supporting a varying range of Java-based SaaS applications",
      "highlights": [
        "Managed Cisco router with load balanced T1's for office connectivity and server hosting",
        "Migrated servers from local hosting to managed hosting provider",
        "Defined and implemented standardized installation and configuration guidelines for all servers in environment",
        "Automated provisioning of new accounts"

      ]
    },
    {
      "company": "Digi-Net Technologies, Inc.",
      "position": "Product Support Manager",
      "startDate": "2000-09-01",
      "endDate": "2002-04-01",
      "summary": "Managed a team of product support engineers, supporting a varying range of Java-based applications on the web",
      "highlights": [
        "Wrote all of the end-user documentation for all of our software products",
        "Served as both technical and customer service escalation point for our customers",
        "Provided on-site training and operations for enterprise-level customers"
      ]
    },
    {
      "company": "Digi-Net Technologies, Inc.",
      "position": "Product Support Engineer",
      "startDate": "2000-05-01",
      "endDate": "2000-09-01",
      "summary": "Provided end-user support for a Java-based chat application",
      "highlights": [
        "Provided end-user support to customers via phone, email, and chat",
        "Guided customer through installation of Java-based server software on a variety of operating systems",
        "Guided customer through integration process of Java applet into their existing web sites",
        "Provided basic web development support",
        "Quickly excelled to role of team lead"
      ]
    }
  ],
  "skills": [
    {
      "name": "Web Development",
      "keywords": [
        "HTML",
        "CSS",
        "Javascript",
        "PHP / CodeIgniter",
        "Python / Django"
      ]
    },
    {
      "name": "Scripting",
      "keywords": [
        "bash",
        "PHP",
        "Python",
        "PowerShell"
      ]
    },
    {
        "name": "Build / Release Management",
        "keywords": [
            "git",
            "subversion",
            "rpm / yum",
            "Jenkins",
            "Maven / Artifactory",
            "Ant",
            "Fabric"
        ]
    },
    {
        "name": "Storage",
        "keywords": [
            "NetApp"
        ]
    },
    {
        "name": "Virtualization",
        "keywords": [
            "VMware vSphere",
            "Citrix XenServer",
            "AWS EC2"
        ]
    },
    {
        "name": "Databases",
        "keywords": [
            "MySQL",
            "PostgreSQL",
            "Oracle",
            "Mongo",
            "Elasticsearch"
        ]
    },
    {
        "name": "Monitoring",
        "keywords": [
            "Nagios",
            "Check MK",
            "OMD",
            "graphite",
            "logstash"
        ]
    },
    {
        "name": "Server Platforms",
        "keywords": [
            "Linux (RHEL, CentOS, Debian)",
            "Windows Server",
            "ESXi"
        ]
    },
    {
        "name": "Application Servers",
        "keywords": [
            "JBoss",
            "Tomcat",
            "WebLogic",
            "Apache httpd / mod_wsgi"
        ]
    },
    {
        "name": "Load Balancers",
        "keywords": [
            "f5 BIG-IP"
        ]
    },
    {
        "name": "Applications",
        "keywords": [
            "Office365 / dirsync / ADFS",
            "ServiceNow"

        ]
    }
  ]
}